const Discord = require("discord.js")

module.exports = {
	"parse": (args) => {
		let msg = args.msg
		if (msg.content.toLowerCase() === '/nabor') { // Embed сообщение про набор
			const exampleEmbed1 = new Discord.MessageEmbed()
				.setColor('#9013FE')
				.setTitle('ШЕСТОЙ НАБОР В АДМИНИСТРАЦИЮ СЕРВЕРА')
				.setAuthor('Ronoserver Services (for Ronoserver)', 'https://cdn.probot.io/ht0KnrUehX.png')
				.setImage('https://media.discordapp.net/attachments/698853696817070164/862871810029649990/0b87113063aceb69.png?width=1440&height=610')
				.setThumbnail('https://probot.media/6NLtslrqWt.png')
				.setDescription('Хей! По Вашим просьбам, делаю шестой набор на работников сервера)\nДобро пожаловать на 6-ой по счёту набор в администрацию/модерацию сервера.\nНабор будет проходить по стандартным правилам, с которыми вы ознакомитесь чуть ниже.\nВсё максимально просто: если Вы - тот, кто желает избираться, то Вы должны убедится что подходите требованиям:\n- У вас должен быть актив на удовлетворительном уровне\n- Вы готовы уделять время Роносерверу\n- Вы соблюдаете правила\n- У вас есть хорошее отношение с коммьюнити сервера\n- Вы готовы быть админом\n\nНа этом вроде всё :3\n\nЕсли вы соответствуете данным требованиям, то спокойно прописывайте команду /админ или /модер (в зависимости на что вы собираетесь претендовать; к администрации требования выше применяются намного жёсче, нежели к модерации); после успешного применения команды я должен буду отправить Вам потверждающее сообщение! Если всё хорошо, то ждите итогов голосования!\n\nТакже, те, кто будет спамить командами автоматически будет отстранён от наборов\n\nВроде бы на этом всё! Если вы собираетесь участвовать в наборе, то желаю вам удачи ;) Результаты будут известны на днях\nЕще увидимся, будущие сотрудники Роносервера\nИскренне\nRonopoldo\nRonoserver Services')
				.setFooter('Ronoserver Services message provided by Ronopoldo#2020', 'https://probot.media/5T6WaVw0jo.png');
			msg.channel.send(exampleEmbed1)
		}
	}
}