// Обработка команды /ping
function parse(msg, Discord) {
 if (msg.content.toLowerCase() === '/rules') //В ковычках то, на что он будет реагировать
  {
const Rules = new Discord.MessageEmbed()
.setTitle("Правила")
.setAuthor("Ronopoldo", "https://media.discordapp.net/attachments/768414683019345931/841699325188767795/Logotip_v3.png", "https://youtube.com/Ronopoldo")
.setColor("#ff8800")
.setDescription("Здравствуйте! Я - официальный бот Ronopoldo, написанный им самим же) Моей работой заключается техническое обслуживание сервера, а также я меняю значок и название сервера в зависимости от времени суток)\nЧуть ниже вы сможете увидеть правила; прочтите и запомните их:")
.addFields(
        { name: '1. Не оскорблять других пользователей', value: 'Вести себя уважительно к другим пользователям (мат разрешен не в оскорбительном контексте кроме NSFW каналов), также на сервере ЕСТЬ мат, но в умеренных количествах; соглашаясь с правилами вы осознаете, что готовы видеть мат и нецензурную брань.' }, {name: '2. Не флудить и использовать каналы по назначению', value: 'Не флудить и не спамить, а также использовать каналы по назначению. Предупреждаю сразу же, что спам участникам сервера в личку будет караться также, как и при спаме в каналы.'}, {name: '3. Не рекламировать что либо кроме канала рекламы', value: 'Любого рода реклама для пиара ЗАПРЕЩЕНА! Вместо этого вы можете использовать канал <#647128722083807240>. За спам в личные сообщения также будем наказывать.'}, {name: '4.  Не говорить о спорных темах', value: 'Например: религии, политике и тд'}, {name: '5. Не пинговать пользователей, если они просят не делать этого', value: 'Не пингуйте тех, кто против этого; также не просите добавления в друзья у меня!'}, {name: '6. Не раскрывать чью-либо личную информацию', value: 'Не делится чьей-либо конфиденциальной информацией без их личного разрешения.'}, {name: '7. Не обходить правила и фильтры ДС', value: 'Нельзя как либо обходить правила и фильтры.'}, {name: '8. Не пингуйте мне по пустякам', value: 'Тут я на самом деле чаще всего буду вас просто игнорировать.'}, {name: '9. Слушаться работников сервера', value: 'Слушаться стафф команду сервера: если они говорят, что вы делаете что-то не так; просто не делайте этого.'}, {name: '10. Не взламывать данный сервер', value: 'Лол) Ну попробуйте))0 Наказать тут уже вряд ли сможем//'}
)
.setFooter("Ronoserver Services message provided by Ronopoldo", "https://media.discordapp.net/attachments/768414683019345931/841699625996255232/Sheriff_ava_3.png")
.setImage("https://i.pinimg.com/originals/e3/8f/72/e38f7224c6c0e12bfcec214af84e8151.png")
.setThumbnail("https://media.discordapp.net/attachments/768414683019345931/841699796481605632/ds_ava_1.png")

    const warn = new Discord.MessageEmbed()
.setTitle("Меры наказания")
.setColor("#8b0000")
.setDescription("За невыполнения правил, модерация может наказать вас одним из существующих видов наказания, однако, наиболее популярным является выдача варна - временного предупреждения. Если вы получите одно такое предупреждение, то ничего не будет и он пропадёт по истечерию срока, который назначит модератор; однако, если вы соберёте несколько варнов, то рискуете получить наказание. Ниже представлен список как раз-таки этих наканазний:\n\n**3предупреждения** - мут на 3 дня\n**6 предупреждений** - мут на 14 дней\n**8 предупреждений** - кик с сервера\n**10 предупреждений** - закрытие в психиатрической больнице сервера (выйти можно только за выкуп)\n**14 предупреждений** - бан на 24 дня\n**16 предупреждений** - можизненный бан\n\nСтарайтесь не нарушать правила и варны для вас будут не страшны ^^")

.setFooter("Ronoserver Services for Ronoserver - 2020", "https://media.discordapp.net/attachments/768414683019345931/841704850139906108/9b6a4cc843e31c1e.png")
.setThumbnail("https://i.pinimg.com/originals/c9/35/a8/c935a89c1f710aafcfac88454ade600c.png")


  msg.channel.send(Rules)
    msg.channel.send(warn)
  }
}

module.exports = { parse }