// Обработка команды /ping
function parse(msg, Discord) {
       if (msg.content === '/шоу')
       {
      const show = new Discord.MessageEmbed()
.setTitle("Шоу Талантов")
.setAuthor("Ronopoldo", "https://media.discordapp.net/attachments/698853696817070164/859960840102739988/2.png?width=670&height=670","https://youtube.com/Ronopoldo")
.setColor('#dc143c')
.setDescription("Вот и долгожданное шоу тут как тут!! \nПриветствую Вас на шоу талантов, которое пройдёт в пятницу, 23 июля 2021 года, ориентировочно в 15:00 по МСК (точное время скажу ближе к сути)\nТе, кто хочет, может посмотреть, как будут выступать участники, нуу... А если Вы сами хотите поучаствовать, то тогда эти правила для Вас:\n1. Выступление должно длиться не более 5 минут\n2. Вы сами отвечаете за организацию выступления\n 3. Без откровенного и запрещённого контента \n4. Разрешены коллабы из 2-х и более человек\n 5. Без глупостей\n\n Правила могут дополняться, следовательно, при дополнении Вы должны будете соблюдать их тоже.\n Насчёт приза пока неизвестно, возможно, он будет, а возможно нет. \n На этом всё! Сохраняем всё в секрете, поэтому для участия Вам надо прописать одну простую команду: `/шоуталантов` и тогда Вы уже будете с нами\nНа этом всё\nЖдите дополнительных постов позже\nИскренне\nРони")
.setFooter("Сообщение предоставлено Ronopoldo#2020 - 18 июля 2021 года 20:40:10 МСК", 'https://media.discordapp.net/attachments/768414683019345931/841704850139906108/9b6a4cc843e31c1e.png')
.setImage("https://media.discordapp.net/attachments/698853696817070164/866373487089418270/0f7c225401f603a9.png")
msg.channel.send(show)
     }
}
module.exports = { parse }